app/controllers/pacientes_controller.rb

  def index
    @pacientes = Paciente.all
---
SELECT "pacientes".* FROM "pacientes"

  def create
    @paciente = Paciente.new(paciente_params)
    #@paciente = current_user.pacientes.build(paciente_params)
    psicologos_for_select
    respond_to do |format|
      @paciente.user = current_user
      if @paciente.save
---
INSERT INTO "pacientes" ("nome", "cpf", "telefone", "email", "endereco", "estado_civil", "quantidade_filhos", "medicamentos", "e_fumante", "ingere_alcool", "psicologo_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @paciente.update(paciente_params)
---
UPDATE "pacientes" SET "estado_civil" = ?, "updated_at" = ? WHERE "pacientes"."id" = ?  [["estado_civil", "Casado"], ["updated_at", "2021-07-18 17:10:48.972194"], ["id", 1]]

    def set_paciente
      @paciente = Paciente.where("id = ?", params[:id]).first
---
SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]