app/controllers/psicologos_controller.rb

SELECT "psicologos".* FROM "psicologos"
---
  def index
    @psicologos = Psicologo.all

INSERT INTO "psicologos" ("crp", "nome", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["crp", "1234567"], ["nome", "Francisco José"], ["created_at", "2021-07-19 06:53:58.985852"], ["updated_at", "2021-07-19 06:53:58.985852"], ["user_id", 1]]
---
  def create
    #@psicologo = Psicologo.new(psicologo_params)
    @psicologo = current_user.psicologos.build(psicologo_params)

    respond_to do |format|
      if @psicologo.save

UPDATE "psicologos" SET "crp" = ?, "updated_at" = ? WHERE "psicologos"."id" = ?  [["crp", "9876542"], ["updated_at", "2021-07-18 17:10:27.466417"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @psicologo.update(psicologo_params)

DELETE FROM "psicologos" WHERE "psicologos"."id" = ?  [["id", 2]]
---
  def destroy
    @psicologo.destroy

SELECT "psicologos".* FROM "psicologos" WHERE (id = '2') ORDER BY "psicologos"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def set_psicologo
      @psicologo = Psicologo.where("id = ?", params[:id]).first