app/controllers/sessaos_controller.rb

  def index
    @sessaos = Sessao.all
---
SELECT "sessaos".* FROM "sessaos"

  def create
    @sessao = Sessao.new(sessao_params)
    psicologos_for_select
    pacientes_for_select
    respond_to do |format|
      @sessao.user = current_user
      if @sessao.save
---
INSERT INTO "sessaos" ("data", "hora", "user_id", "paciente_id", "psicologo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @sessao.update(sessao_params)
---
UPDATE "sessaos" SET "psicologo_id" = ?, "updated_at" = ? WHERE "sessaos"."id" = ?  [["psicologo_id", 2], ["updated_at", "2021-07-18 17:56:24.839129"], ["id", 4]]

  def destroy
    @sessao.destroy
---
DELETE FROM "sessaos" WHERE "sessaos"."id" = ?  [["id", 1]]

    def set_sessao
      @sessao = Sessao.where("id = ?", params[:id]).first
---
SELECT "sessaos".* FROM "sessaos" WHERE "sessaos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]